<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |
    | Macedonian translations for authentication feedback messages.
    |
    */

    'failed' => 'Овие креденцијали не се совпаѓаат со нашите записи.',
    'password' => 'Внесената лозинка е неточна.',
    'throttle' => 'Премногу обиди за најава. Обидете се повторно за :seconds секунди.',

];

