<?php

return [
    'accepted' => 'Полето :attribute мора да биде прифатено.',
    'boolean' => 'Полето :attribute мора да биде вистинито или невистинито.',
    'confirmed' => 'Потврдата за :attribute не се совпаѓа.',
    'email' => 'Полето :attribute мора да биде валидна е-пошта.',
    'exists' => 'Избраното :attribute не е валидно.',
    'min' => [
        'string' => 'Полето :attribute мора да содржи најмалку :min карактери.',
    ],
    'regex' => 'Форматот на :attribute не е валиден.',
    'required' => 'Полето :attribute е задолжително.',
    'string' => 'Полето :attribute мора да биде текст.',
    'unique' => 'Полето :attribute веќе постои.',

    'password' => [
        'letters' => 'Лозинката мора да содржи барем една буква.',
        'mixed' => 'Лозинката мора да содржи барем една голема и една мала буква.',
        'numbers' => 'Лозинката мора да содржи барем една цифра.',
        'symbols' => 'Лозинката мора да содржи барем еден специјален знак.',
        'uncompromised' => 'Внесената лозинка се појавува во протечени податоци. Ве молиме одберете друга лозинка.',
    ],

    'custom' => [
        'email' => [
            'email' => 'Избраната е-пошта не е валидна.',
            'exists' => 'Избраната е-пошта не е валидна.',
        ],
    ],

    'attributes' => [
        'name' => 'име',
        'email' => 'е-пошта',
        'password' => 'лозинка',
        'password_confirmation' => 'потврда за лозинка',
        'gender' => 'род',
        'preference' => 'преференца',
        'location' => 'локација',
        'date' => 'датум на раѓање',
        'telephone' => 'телефон',
        'profile_picture' => 'профилна слика',
        'remember' => 'запомни ме',
    ],
];

